# StructuralMaterialId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..StructuralMaterialId Property
FamilyInstance Class See Also
---
Identifies the material that defines the instance's structural analysis properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId StructuralMaterialId { get; set; }
```

Visual Basic
---
```text
Public Property StructuralMaterialId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ StructuralMaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace